postmancollection.json

{
	"info": {
		"_postman_id": "6805813d-b4c9-4412-8434-4ec995862a43",
		"name": "API Connect SOAP System",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "5725171"
	},
	"item": [
		{
			"name": "https://www.w3schools.com:443/xml/tempconvert.asmx",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ns=\"https://www.w3schools.com/xml/\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <ns:CelsiusToFahrenheit>\r\n         <!--Optional:-->\r\n         <ns:Celsius>30</ns:Celsius>\r\n      </ns:CelsiusToFahrenheit>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "https://www.w3schools.com:443/xml/tempconvert.asmx",
					"protocol": "https",
					"host": [
						"www",
						"w3schools",
						"com"
					],
					"port": "443",
					"path": [
						"xml",
						"tempconvert.asmx"
					]
				}
			},
			"response": []
		},
		{
			"name": "https://localhost:9444/localtest/sandbox/tempconvert/FahrenheitToCelsius",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					},
					{
						"key": "X-IBM-Client-Id",
						"value": "1e78e21fcec07671009beab0fc6a8124",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ns=\"https://www.w3schools.com/xml/\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <ns:CelsiusToFahrenheit>\r\n         <!--Optional:-->\r\n         <ns:Celsius>30</ns:Celsius>\r\n      </ns:CelsiusToFahrenheit>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "https://localhost:9444/localtest/sandbox/tempconvert/FahrenheitToCelsius",
					"protocol": "https",
					"host": [
						"localhost"
					],
					"port": "9444",
					"path": [
						"localtest",
						"sandbox",
						"tempconvert",
						"FahrenheitToCelsius"
					]
				}
			},
			"response": []
		},
		{
			"name": "GEO E3 https://api.ap-southeast-a.apiconnect.ibmappdomain.cloud/techsales/sandbox/geoe3platform.eu/geoe3/temperature/collections/temperature_FI?f=json",
			"request": {
				"method": "GET",
				"header": [
					{
						"key": "X-IBM-Client-Secret",
						"value": "0c9b936fe497bd1fafba1de5a8c78f2f",
						"type": "text"
					},
					{
						"key": "X-IBM-Client-Id",
						"value": "3cf41391615645b98a160b82fdb410d2",
						"type": "text"
					}
				],
				"url": {
					"raw": "https://api.ap-southeast-a.apiconnect.ibmappdomain.cloud/techsales/sandbox/geoe3platform.eu/geoe3/temperature/collections/temperature_FI?f=json",
					"protocol": "https",
					"host": [
						"api",
						"ap-southeast-a",
						"apiconnect",
						"ibmappdomain",
						"cloud"
					],
					"path": [
						"techsales",
						"sandbox",
						"geoe3platform.eu",
						"geoe3",
						"temperature",
						"collections",
						"temperature_FI"
					],
					"query": [
						{
							"key": "f",
							"value": "json"
						}
					]
				}
			},
			"response": []
		},
		{
			"name": "SOAP Calculate Parameter https://api.ap-southeast-a.apiconnect.ibmappdomain.cloud/techsales/sandbox/tempconvert/FahrenheitToCelsius",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					},
					{
						"key": "X-IBM-Client-Id",
						"value": "8547c5e18d3ea9607603564de4b287b0",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ns=\"https://www.w3schools.com/xml/\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <ns:CelsiusToFahrenheit>\r\n         <!--Optional:-->\r\n         <ns:Celsius>30</ns:Celsius>\r\n      </ns:CelsiusToFahrenheit>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>"
				},
				"url": {
					"raw": "https://api.ap-southeast-a.apiconnect.ibmappdomain.cloud/techsales/sandbox/tempconvert/FahrenheitToCelsius",
					"protocol": "https",
					"host": [
						"api",
						"ap-southeast-a",
						"apiconnect",
						"ibmappdomain",
						"cloud"
					],
					"path": [
						"techsales",
						"sandbox",
						"tempconvert",
						"FahrenheitToCelsius"
					]
				}
			},
			"response": []
		},
		{
			"name": "SOAP Get List By Name and REDACT https://api.ap-southeast-a.apiconnect.ibmappdomain.cloud/techsales/sandbox/soapdemo/GetListByName",
			"event": [
				{
					"listen": "test",
					"script": {
						"exec": [
							""
						],
						"type": "text/javascript"
					}
				}
			],
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					},
					{
						"key": "X-IBM-Client-Id",
						"value": "8547c5e18d3ea9607603564de4b287b0",
						"type": "text"
					},
					{
						"key": "SOAPAction",
						"value": "GetListByName",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tem=\"http://tempuri.org\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <tem:GetListByName>\r\n         <!--Optional:-->\r\n         <!-- <tem:name>?</tem:name> -->\r\n      </tem:GetListByName>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>"
				},
				"url": {
					"raw": "https://api.ap-southeast-a.apiconnect.ibmappdomain.cloud/techsales/sandbox/soapdemo/GetListByName",
					"protocol": "https",
					"host": [
						"api",
						"ap-southeast-a",
						"apiconnect",
						"ibmappdomain",
						"cloud"
					],
					"path": [
						"techsales",
						"sandbox",
						"soapdemo",
						"GetListByName"
					]
				}
			},
			"response": []
		},
		{
			"name": "https://www.crcind.com:443/csp/samples/SOAP.Demo.cls",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml;charset=UTF-8",
						"type": "text"
					},
					{
						"key": "SOAPAction",
						"value": "GetListByName",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tem=\"http://tempuri.org\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <tem:GetListByName>\r\n         <!--Optional:-->\r\n     \r\n      </tem:GetListByName>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "https://www.crcind.com:443/csp/samples/SOAP.Demo.cls",
					"protocol": "https",
					"host": [
						"www",
						"crcind",
						"com"
					],
					"port": "443",
					"path": [
						"csp",
						"samples",
						"SOAP.Demo.cls"
					]
				}
			},
			"response": []
		},
		{
			"name": "https://api-naomilin-dev.apps.rm3.7wse.p1.openshiftapps.com/purchase-order",
			"request": {
				"method": "GET",
				"header": []
			},
			"response": []
		}
	]
}